Autodesk.Revit.DB.FabricationService.OverrideServiceButtonExclusion(System.Int32,System.Int32,System.Boolean)
Overrides the default service button exclusions, used by Route and Fill or Design to Fabrication, for the current user and session only.
groupIndex:
The index of the service group to exclude the service button from.
buttonIndex:
The index of the service button to exclude.
exclude:
Pass true to exclude from being used by Route and Fill or Design to Fabrication.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the index groupIndex is not larger or equal to 0 and less than GroupCount
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2017 Subscription Update

Autodesk.Revit.DB.FabricationService.SetServiceGroupExclusions(System.Collections.Generic.IList{System.Int32})
Sets the service group exclusions, used by Route and Fill or Design to Fabrication commands, for the current user and session only. This will alter them from the default configuration exclusions to only exclude those groups passed.
excludedGroups:
A list of service group indexes to be excluded.
Returns:
Returns true if succeeded to set the override theon the group(s).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
groupIndices contains an index that is not larger or equal to 0 and less than GroupCount
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2017 Subscription Update

Autodesk.Revit.DB.FabricationService.IsGroupExcluded(System.Int32)
Get whether a service group is excluded from being used by the Route and Fill or Design to Fabrication commands. The default configuration values may be overridden by SetServiceGroupExclusions.
groupIndex:
The index of the group.
Returns:
Returns true if the group indexed by groupIndex is currently excluded.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the index groupIndex is not larger or equal to 0 and less than GroupCount
Since:
2017 Subscription Update